# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# 
# Пример:
# 
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

list = [3, 9, 6, 7, 5]
n = 0
w = -1
while (n < (len(list)/2)):
    p = list[n] * list[w]
    n = n + 1
    w = w - 1
    print (f'{p} ', end = '')